In [3]:
import pandas as pd 
import matplotlib.pyplot as plt

In [4]:
df = pd.read_csv('../data/bachelor.csv')

In [5]:
df

,Name,Age,Occupation,Hometown,Height,ElimWeek,Season
0,Nikki Ferrell,26,Pediatric Nurse,"Kearney, Missouri",NaN,NaN,18
1,Clare Crawley,32,Hairstylist,"Sacramento, California",NaN,10.0,18
2,Andi Dorfman,26,Assistant District Attorney,"Buckhead, Georgia",NaN,9.0,18
3,Renee Oteri,32,Real Estate Agent,"Martha's Vineyard, Massachusetts",NaN,8.0,18
4,Chelsie Webster,24,Science Educator,"Lexington, Ohio",NaN,7.0,18
...,...,...,...,...,...,...,...
199,Jenna Serrano,22,Nursing Student,"New Lenox, Illinois",NaN,1.0,24
200,Katrina Badowski,28,Pro NBA Dancer,"St. Charles, Illinois",NaN,1.0,24
201,Kylie Ramos,26,Entertainment Sales Associate,"Davis, California",NaN,1.0,24
202,Maurissa Gunn,23,Patient Care Coordinator,"Laurel, Montana",NaN,1.0,24
203,Megan Hops,26,Flight Attendant,"San Bruno, California",NaN,1.0,24

In [6]:
bachelorette = pd.read_csv('../data/bachelorette.csv')

In [7]:
bachelorette

,SHOW,SEASON,CONTESTANT,ELIMINATION-1,ELIMINATION-2,ELIMINATION-3,ELIMINATION-4,ELIMINATION-5,ELIMINATION-6,ELIMINATION-7,...,DATES-1,DATES-2,DATES-3,DATES-4,DATES-5,DATES-6,DATES-7,DATES-8,DATES-9,DATES-10
0,SHOW,SEASON,ID,1,2,3,4,5,6,7,...,1,2,3,4,5,6,7,8,9,10
1,Bachelorette,13,13_BRYAN_A,R1,NaN,NaN,R,R,NaN,R,...,NaN,NaN,D6,D13,D1,D7,D1,D1,D1,D1
2,Bachelorette,13,13_PETER_K,NaN,R,NaN,NaN,NaN,R,R,...,NaN,D1,D6,D13,D9,D7,D1,D1,D1,D1
3,Bachelorette,13,13_ERIC_B,NaN,NaN,R,NaN,NaN,R,R,...,NaN,D10,D8,D13,D9,D1,D3,D1,D1,NaN
4,Bachelorette,13,13_DEAN_U,NaN,R,NaN,R,NaN,NaN,R,...,NaN,D8,D8,D1,D9,D7,D1,D1,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
916,Bachelor,01,01_KRISTINA_X,E,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
917,Bachelor,01,01_LISA_X,E,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
918,Bachelor,01,01_PAULA_X,E,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
919,Bachelor,01,01_RACHEL_X,E,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
920,Bachelor,01,01_WENDI_X,E,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df.groupby(['Season', 'Age', 'Name'])['Age'].count()

Season  Age  Name
18      22   Cassandra Ferguson    1
        23   Christine Llano       1
             Kylie Lewis           1
        24   Alexis Morgado        1
             Chelsie Webster       1
                                  ..
24      27   Shiann Lewis          1
             Victoria Paul         1
        28   Katrina Badowski      1
             Kelsey Weier          1
        31   Natasha Parker        1
Name: Age, Length: 204, dtype: int64

In [12]:
df['Age'].value_counts()

26    35
25    33
23    31
24    28
27    22
29    14
28    13
30    10
31     8
22     4
32     3
33     2
21     1
Name: Age, dtype: int64

In [14]:
df_18 = df.loc[(df['Season'] == 18)]['Age'].value_counts()
df_18

25    6
26    5
27    4
24    4
29    2
23    2
32    2
31    1
22    1
Name: Age, dtype: int64

In [15]:
df_19 = df.loc[(df['Season'] == 19)]['Age'].value_counts()
df_19

29    5
25    5
24    5
28    4
26    4
30    2
27    2
31    1
21    1
33    1
Name: Age, dtype: int64

In [16]:
df_20 = df.loc[(df['Season'] == 20)]['Age'].value_counts()
df_20

23    8
25    6
24    5
30    3
26    3
27    2
28    1
Name: Age, dtype: int64

In [17]:
df_21 = df.loc[(df['Season'] == 21)]['Age'].value_counts()
df_21

25    7
26    5
24    5
23    4
29    3
31    2
28    2
30    1
27    1
Name: Age, dtype: int64

In [18]:
df_22 = df.loc[(df['Season'] == 22)]['Age'].value_counts()
df_22

27    6
26    6
25    4
30    3
29    3
23    2
31    1
28    1
22    1
33    1
32    1
Name: Age, dtype: int64

In [19]:
df_23 = df.loc[(df['Season'] == 23)]['Age'].value_counts()
df_23

23    9
26    5
25    4
24    4
28    3
31    2
30    1
29    1
27    1
Name: Age, dtype: int64

In [20]:
df_24 = df.loc[(df['Season'] == 24)]['Age'].value_counts()
df_24

26    7
27    6
23    6
24    5
28    2
22    2
31    1
25    1
Name: Age, dtype: int64

In [ ]:
import numpy as np

fig, ax = plt.subplots(figsize = (15, 7.5))

x = [x for x in df_18.index]
x1 = [x for x in df_19.index]
x2 = [x for x in df_20.index]
x3 = [x for x in df_21.index]
x4 = [x for x in df_22.index]
x5 = [x for x in df_23.index]
x6 = [x for x in df_24.index]

y = list(df_18.values)
y1 = list(df_19.values)
y2 = list(df_20.values)
y3 = list(df_21.values)
y4 = list(df_22.values)
y5 = list(df_23.values)
y6 = list(df_24.values)

w = .2
plt.bar(np.array(x), y, w, label='Season 19', color = 'black')
plt.bar(np.array(x1) + w, y1, w, label="Season 20", color = 'magenta')
plt.bar(np.array(x2) + w*2, y2, w, label="Season 21", color = 'midnightblue')
plt.bar(np.array(x3) + w*3, y3, w, label="Season 22", color = 'red')
plt.bar(np.array(x4) + w*4, y4, w, label="Season 23", color = 'yellow')
plt.bar(np.array(x5) + w*5, y5, w, label="Season 24", color = 'orange')
plt.bar(np.array(x6) + w*6, y6, w, label="Season 25", color = 'green')
ax.set_xlabel('Ages', fontsize = 12)
ax.set_ylabel('Number of Contestants', fontsize = 12)
ax.set_title('Number of Contestants at Each Age', fontsize = 20)
# plt.xticks(x + w*.5, ['20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35'], fontsize = 11)
plt.yticks()
plt.legend(['season18', 'season19', 'season20', 'season21', 'season22', 'season23', 'season24'])

plt.show()

plt.savefig('extendedbachelor')